# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_19Jan/tech/NangateOpenCellLibrary_typical.lib
read_verilog  /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_19Jan/counter.v

# High-level synthesis
synth -auto-top
# Map register flops
dfflibmap -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_19Jan/tech/NangateOpenCellLibrary_typical.lib
opt

# Map combinatorial cells, standard script
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_19Jan/tech/NangateOpenCellLibrary_typical.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
hilomap -hicell LOGIC1_X1 Z
hilomap -locell LOGIC0_X1 Z
# Output buffering
iopadmap -outpad BUF_X1 A:Z -bits
# Cleanup
#splitnets
opt
clean
rename -enumerate
write_verilog -noattr /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_19Jan/synthesis/synth_premap.v 
write_blif -buf BUF_X1 A Z /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_19Jan/synthesis/synth_premap.blif 
write_json /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_19Jan/synthesis/synth_premap.json 

stat
