ghdl /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/counter_4bit.vhd -e counter_4bit 
hierarchy -check -auto-top
synth; opt -full
flatten

# placeholder for dfflibmap
dfflibmap -liberty /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/lib/mycells_yosys.lib 

# dfflibmap -liberty mycells.lib

opt

# placeholder for abc
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/lib/mycells_yosys.lib 

# abc -liberty mycells.lib 

opt
hilomap -hicell TIEHIM Y -locell TIELOM Y
iopadmap -bits -inpad IBUF O:I -outpad OBUF I:O
splitnets
opt
clean -purge

# placeholder for premap_synthesis file
write_verilog -noattr /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/synthesis/synth_premap.v 
write_blif /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/synthesis/synth_premap.blif 
write_json /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/synthesis/synth_premap.json 

# write_verilog -noattr synth_premap.v
# write_blif synth_premap.blif
# write_json synth_premap.v

# placeholder techmap
techmap -map /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/lib/DFF_map.v 
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/lib/mycells_yosys.lib 
opt; clean -purge
techmap -map /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/lib/Logic_map.v 

# techmap -map DFF_map.v
# techmap -map Logic_map.v

opt
clean -purge
opt_clean
stat

# placeholder for postmap_synthesis file
write_verilog -noattr /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/synthesis/synth_postmap.v 
write_json /Users/ebinouri/Documents/UNi/NBGen/testsuites/counter_vhdl/synthesis/synth_postmap.json 

# write_verilog -noattr synth_postmap.v
# write_json -noattr synth_postmap.v