# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/tech/NangateOpenCellLibrary_typical.lib
read_verilog  /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/map9v3.v

# High-level synthesis
synth -top map9v3
# Map register flops
dfflibmap -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/tech/NangateOpenCellLibrary_typical.lib
opt

# Map combinatorial cells, standard script
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/tech/NangateOpenCellLibrary_typical.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
hilomap -hicell LOGIC1_X1 Z
hilomap -locell LOGIC0_X1 Z
# Output buffering
iopadmap -outpad BUF_X1 A:Z -bits
# Cleanup
splitnets
opt
clean
rename -enumerate
write_verilog -noattr //Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/synthesis/synth_premap.v 
write_blif -buf BUF_X1 A Z //Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/synthesis/synth_premap.blif 
write_blif -buf BUF_X1 A Z //Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/synthesis/map9v3_mapped.blif 
write_json //Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_qflow_45nm/synthesis/synth_premap.json 

stat
