read_verilog /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/topmodule.v 
hierarchy -check -auto-top
synth; flatten
opt -full

# placeholder for dfflibmap
dfflibmap -liberty /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/lib/mycells_yosys.lib 

# dfflibmap -liberty mycells.lib

opt

# placeholder for abc
abc -liberty /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/lib/mycells_yosys.lib 

# abc -liberty mycells.lib 

opt
hilomap -hicell TIEHIM Y -locell TIELOM Y
iopadmap -bits -inpad IBUF O:I -outpad OBUF I:O
splitnets
opt
clean -purge

# placeholder for premap_synthesis file
write_verilog -noattr /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/synthesis/synth_premap.v 
write_blif /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/synthesis/synth_premap.blif 
# write_verilog -noattr synth_premap.v
# write_blif synth_premap.blif

# placeholder techmap
techmap -map /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/lib/Logic_map.v 
techmap -map /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/lib/DFF_map.v 

# techmap -map Logic_map.v
# techmap -map DFF_map.v

opt_clean
stat

# placeholder for postmap_synthesis file
write_verilog -noattr /Users/ebinouri/Documents/UNi/netListGen/python_wrapper/synthesis/synth_postmap.v 

# write_verilog -noattr synth_premap.v