ghdl /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_vhdl_15nm/fulladder.vhd  -e fulladder 
# High-level synthesis
hierarchy -check -auto-top
synth; opt -full

# Map register flops
# placeholder for dfflibmap
dfflibmap -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_vhdl_15nm/tech/NanGate_15nm_OCL_typical_conditional_nldm.lib 

# dfflibmap -liberty mycells.lib

opt

# Map combinatorial cells, standard script
# placeholder for abc
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_vhdl_15nm/tech/NanGate_15nm_OCL_typical_conditional_nldm.lib 

# abc -liberty mycells.lib 

flatten
opt

# technology mapping of constant hi- and/or lo- drivers
# placeholder for constant mapping
hilomap -hicell TIEH Z 
hilomap -locell TIEL ZN 

# hilomap -hicell TIEHIM Y -locell TIELOM Y
# technology mapping of i/o pads (or buffers)
# placeholder for i/o pads mapping
iopadmap -inpad BUF_X1 Z:I -bits 
iopadmap -outpad BUF_X1 I:Z -bits 

# iopadmap -bits -inpad IBUF O:I -outpad OBUF I:O

splitnets
opt
clean -purge

# placeholder for premap_synthesis file
write_verilog -noattr /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_vhdl_15nm/synthesis/synth_premap.v 
write_blif /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_vhdl_15nm/synthesis/synth_premap.blif 
write_json /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/fulladder_vhdl_15nm/synthesis/synth_premap.json 

# write_verilog -noattr synth_premap.v
# write_blif synth_premap.blif
# write_json synth_premap.v

# placeholder techmap
# techmap -map DFF_map.v
# techmap -map Logic_map.v

opt
clean -purge
opt_clean
stat

# placeholder for postmap_synthesis file
# write_verilog -noattr synth_postmap.v
# write_json -noattr synth_postmap.v