read_verilog /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/counter.v  
# High-level synthesis
hierarchy -check -auto-top
synth; opt -full

# placeholder for reading liberty file 
read_liberty -lib -ignore_miss_dir -setattr blackbox /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/tech/NangateOpenCellLibrary_typical.lib 


# Map register flops
# placeholder for dfflibmap
dfflibmap -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/tech/NangateOpenCellLibrary_typical.lib 

# dfflibmap -liberty mycells.lib

opt

# Map combinatorial cells, standard script
# placeholder for abc
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/tech/NangateOpenCellLibrary_typical.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D} 

# abc -liberty mycells.lib 

# placeholder for flatten option
opt

splitnets
techmap 
# placeholder for abc after splitnets
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/tech/NangateOpenCellLibrary_typical.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D} 

# abc -liberty mycells.lib 
opt
clean -purge
opt_clean

# technology mapping of constant hi- and/or lo- drivers
# placeholder for constant mapping
# hilomap -hicell TIEHIM Y -locell TIELOM Y
# technology mapping of i/o pads (or buffers)
# placeholder for i/o pads mapping
iopadmap -inpad BUF_X1 Z:A -bits 
iopadmap -outpad BUF_X1 A:Z -bits 

# iopadmap -bits -inpad IBUF O:I -outpad OBUF I:O


# placeholder for premap_synthesis file
write_verilog -noattr /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/synthesis/synth_premap.v 
write_blif /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/synthesis/synth_premap.blif 
write_json /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/counter_bist_15nov/synthesis/synth_premap.json 

# write_verilog -noattr synth_premap.v
# write_blif synth_premap.blif
# write_json synth_premap.v

# placeholder techmap
# techmap -map DFF_map.v
# techmap -map Logic_map.v

opt
clean -purge
opt_clean
stat

# placeholder for postmap_synthesis file
# write_verilog -noattr synth_postmap.v
# write_json -noattr synth_postmap.v