# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/osu018_stdcells.lib
read_verilog -lib /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/osu018_stdcells.v
read_verilog  /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/synth_premap.v

# High-level synthesis
synth -auto-top
# Map register flops
dfflibmap -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/osu018_stdcells.lib
opt

# Map combinatorial cells, standard script
abc -liberty /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/osu018_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
#flatten
setundef -zero

clean -purge
#hilomap -hicell LOGIC1_X1 Z
#hilomap -locell LOGIC0_X1 Z
## Output buffering
#iopadmap -outpad BUF_X1 A:Z -bits
# Cleanup
#splitnets
opt
clean
rename -enumerate
write_verilog -noattr /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/synth_premap_2.v 
write_blif -buf BUF_X1 A Z /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/synth_premap.blif 
write_json /Users/ebinouri/Documents/UNi/NBGen/pypi_package/test/vesal_mac_mycells/synth_premap.json 

stat
